In [4]:
import pandas as pd
import os

In [5]:
# Deliverable 1:

In [6]:
# Create the path and import the data
full_student_data = os.path.join('Resources/new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)

In [7]:
# Verify that the data was properly imported
student_df.head(5)

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [8]:
# Deliverable 2:

In [9]:
# Check for null values
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [10]:
# Drop rows with null values and verify removal
student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [11]:
# Check for duplicated rows
student_df.duplicated().sum()

1836

In [31]:
# Drop duplicated rows and verify removal
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [12]:
# Check data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [13]:
# Examine the grade column to understand why it is not an int
student_df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19509    12th
19510     9th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 16667, dtype: object

In [14]:
# Remove the non-numeric characters and verify the contents of the column
student_df['grade'] = student_df['grade'].str.replace('th', '')
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19509    12
19510     9
19511    11
19512    11
19513    12
Name: grade, Length: 16667, dtype: object

In [32]:
# Change the grade column to the int type and verify column types
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [15]:
# Deliverable 3:

In [16]:
# Display summary statistics for the DataFrame
student_df.describe()

         student_id  reading_score    math_score  school_budget
count  1.666700e+04   16667.000000  16667.000000   16667.000000
mean   6.983096e+07      72.395068     64.589560  893784.963581
std    3.453505e+07      15.224093     15.816358   53963.679617
min    1.000906e+07      10.500000      3.700000  817615.000000
25%    3.990829e+07      62.300000     54.300000  846745.000000
50%    6.977253e+07      73.800000     65.200000  893368.000000
75%    9.938019e+07      84.000000     75.900000  956438.000000
max    1.299997e+08     100.000000    100.000000  991918.000000

In [17]:
# Display the mean math score using the mean function
mean_math_score = student_df['math_score'].mean()
mean_math_score

64.58956020879589

In [18]:
# Store the minimum reading score as min_reading_score
min_reading_score = student_df['reading_score'].min()
min_reading_score

10.5

In [19]:
# Deliverable 4:

In [20]:
# Use loc to display the grade column
student_df.loc[:,'grade']

0         9
1         9
2         9
3         9
5         9
         ..
19509    12
19510     9
19511    11
19512    11
19513    12
Name: grade, Length: 16667, dtype: object

In [21]:
# Use `iloc` to display the first 3 rows and columns 3, 4, and 5.
student_df.iloc[0:3, [3,4,5]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [22]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`.
gradenine = student_df.loc[(student_df["grade"] == "9")]
gradenine.describe()

         student_id  reading_score   math_score  school_budget
count  4.651000e+03    4651.000000  4651.000000    4651.000000
mean   6.989824e+07      69.215029    66.469383  898677.405074
std    3.471276e+07      15.342495    16.668006   54794.764822
min    1.000906e+07      17.900000     5.300000  817615.000000
25%    3.987328e+07      59.000000    55.900000  846745.000000
50%    7.017398e+07      70.100000    67.600000  893368.000000
75%    9.959880e+07      80.600000    78.400000  957299.000000
max    1.299997e+08      99.900000   100.000000  991918.000000

In [23]:
# Store the row with the minimum overall reading score as `min_reading_row` using `loc` and the
# `min_reading_score` found in Deliverable 3.
min_reading_row = student_df["reading_score"].min()
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_row]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [24]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.

In [25]:
# Find the mean reading score for all students in grades 11 and 12 combined.
mean_reading_score = student_df["reading_score"].mean()
mean_reading_score

72.39506809863815

In [26]:
# Deliverable 5:

In [27]:
# Use groupby and mean to find the average reading and math scores for each school type.
avg_student_scores_by_grade = student_df.groupby(by='school_type').mean()
avg_student_scores_by_grade.loc[:, ["math_score", "reading_score"]]

             math_score  reading_score
school_type
Charter       66.615521      72.577870
Public        62.911409      72.243649

In [28]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.

min_scores_by_school = student_df.groupby(by='school_name').count()
min_scores_by_school.iloc[0,0]

888

In [33]:
# Find the average math score by grade for each school type by using the groupby and mean functions
avg_by_school = student_df.groupby(['school_type', 'grade']).mean()
avg_by_school.loc[:, ["reading_score"]]

                   reading_score
school_type grade
Charter     9          68.676790
            10         69.628822
            11         80.596379
            12         70.475421
Public      9          69.687981
            10         73.160461
            11         73.486448
            12         73.342380

In [30]:
# Deliverable 6:
# I was tasked by Maria to sort, analyze, and report school district data. My findings include various reading and
# math scores for schools in a district level. This includes Charter and Public schools and different grade levels.
# I have found out that 9th graders, whether charter or public have the highest math scores and 11th graders have the
# highest reading scores.